{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3fcc3bc8-a0f8-4115-b0f2-b7e4667d06e9",
   "metadata": {},
   "source": [
    "Даша составляет 7-буквенные слова из букв БАНДЕРОЛЬ. \n",
    "Мягкий знак используется в каждом слове не больше одного раза. \n",
    "Остальные буквы могут быть использованы сколько угодно раз или не использоваться совсем.\n",
    "\n",
    "Сколько слов может составить Даша, если известно, \n",
    "что буква Е не может стоять рядом с согласными?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "316a41f2-8eef-45b5-a854-0b13751d6cdc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1984630\n"
     ]
    }
   ],
   "source": [
    "from itertools import product\n",
    " \n",
    "alphabet = 'БАНДЕРОЛЬ'\n",
    "consonants = set('БНДРЛ')\n",
    "\n",
    "def is_valid(word):\n",
    "    # Условие 1: мягкий знак не больше одного раза\n",
    "    if word.count('Ь') > 1:\n",
    "        return False\n",
    "    # Условие 2: Е не соседствует с согласными\n",
    "    n = len(word)\n",
    "    for i in range(n):\n",
    "        if word[i] == 'Е':\n",
    "            # Проверяем левого соседа\n",
    "            if i > 0 and word[i - 1] in consonants:\n",
    "                return False\n",
    "            # Проверяем правого соседа\n",
    "            if i < n - 1 and word[i + 1] in consonants:\n",
    "                return False\n",
    "    \n",
    "    return True\n",
    "\n",
    "count = 0\n",
    "for comb in product(alphabet, repeat=7):\n",
    "    if is_valid(comb):\n",
    "        count += 1\n",
    "\n",
    "print(count)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ddfe658-0ecf-4d36-a694-1612cb655cb5",
   "metadata": {},
   "source": [
    "Сколько существует восьмеричных шестизначных чисел, \n",
    "в которых все цифры различны, никакие две чётные или две нечётные цифры не стоят рядом и \n",
    "десятичная запись которых делится на 5?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "416d1c1c-c951-43ee-acf5-2c97f459063b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "208\n"
     ]
    }
   ],
   "source": [
    "from itertools import permutations\n",
    "\n",
    "digits = \"01234567\"\n",
    "n = 6\n",
    "even = set(\"0246\")\n",
    "odd = set(\"1357\")\n",
    "\n",
    "def is_valid(num, n):\n",
    "    # не начинается с 0\n",
    "    if num[0] == '0':\n",
    "        return False\n",
    "    # десятичная запись делится на 5\n",
    "    if int(num, base=8) % 5 != 0:\n",
    "        return False\n",
    "    # чередование чет, нечет\n",
    "    for i in range(5):\n",
    "        curr_is_even = int(num[i]) % 2 == 0\n",
    "        next_is_even = int(num[i+1]) % 2 == 0\n",
    "        if (curr_is_even and next_is_even) or not (curr_is_even or next_is_even):\n",
    "            return False\n",
    "\n",
    "    return True\n",
    "\n",
    "counter = 0\n",
    "for num in permutations(digits, 6):\n",
    "    num = ''.join(num)\n",
    "    if is_valid(num, n):\n",
    "        counter += 1\n",
    "\n",
    "print(counter)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c60de9ae-edbe-4749-b70b-8cff381d457b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
