{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "e859cabe-8bc4-4f50-9adc-b56b0a4301c0",
   "metadata": {},
   "source": [
    "В терминологии сетей TCP/IP маска сети — это двоичное число, меньшее \n",
    "2^32; в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.\n",
    "\n",
    "Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая — к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам, что и IP-адрес — в виде четырёх байт, причём каждый байт записывается в виде десятичного числа.\n",
    "\n",
    "Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске. Например, если IP-адрес узла равен 131.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.\n",
    "\n",
    "Для узла с IP-адресом 111.91.200.28 адрес сети равен 111.91.192.0. Найдите наименьшее возможное количество нулей в двоичной записи маски подсети."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "bf187ff7-54e0-418b-a997-de0fdbd631bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0b1101111010110111100100000011100\n",
      "0b1101111010110111100000000000000\n",
      "12\n"
     ]
    }
   ],
   "source": [
    "from ipaddress import ip_network\n",
    "\n",
    "# net = ip_network('192.168.32.160/255.255.255.240')\n",
    "\n",
    "# for ip in net:\n",
    "#     print(type(ip))\n",
    "\n",
    "def min_zeros_in_mask(host_ip, network_ip):\n",
    "    # Преобразуем IP в 32-битные числа\n",
    "    h = sum(int(x) << (24 - 8*i) for i, x in enumerate(host_ip.split('.')))\n",
    "    n = sum(int(x) << (24 - 8*i) for i, x in enumerate(network_ip.split('.')))\n",
    "\n",
    "    print(bin(h))\n",
    "    print(bin(n))\n",
    "    \n",
    "    return (h ^ n).bit_length()\n",
    "\n",
    "# Решение для конкретной задачи\n",
    "print(min_zeros_in_mask(\"111.91.200.28\", \"111.91.192.0\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1f267cf2-3e13-419f-bc20-02658a8ecccc",
   "metadata": {},
   "source": [
    "Для узла с IP адресом 158.116.11.146 адрес сети равен 158.116.0.0. Для скольких различных значений маски это возможно?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "d4c37484-ea56-45a8-aaa7-ca6fb881a4f6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0b10011110011101000000101110010010\n",
      "0b10011110011101000000000000000000\n"
     ]
    }
   ],
   "source": [
    "from ipaddress import ip_network\n",
    "\n",
    "def get_mask(host_ip, network_ip):\n",
    "    # Преобразуем IP в 32-битные числа\n",
    "    h = sum(int(x) << (24 - 8*i) for i, x in enumerate(host_ip.split('.')))\n",
    "    n = sum(int(x) << (24 - 8*i) for i, x in enumerate(network_ip.split('.')))\n",
    "\n",
    "    print(bin(h))\n",
    "    print(bin(n))\n",
    "\n",
    "# тут смотрим нули между единицами, их 6, значит вариантов 7: 111111, 111110, 111100, 111000, 110000, 100000, 000000\n",
    "\n",
    "# Решение для конкретной задачи\n",
    "get_mask(\"158.116.11.146\", \"158.116.0.0\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f59f8cfd-c4ec-4e75-8868-a371b4144462",
   "metadata": {},
   "source": [
    "Для узла с IP-адресом 215.181.200.27 адрес сети равен 215.181.192.0. Чему равно наибольшее возможное значение третьего слева байта маски? Ответ запишите в виде десятичного числа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "12553cb3-bda5-4300-a565-c95b9d882030",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0b11010111101101011100100000011011\n",
      "0b11010111101101011100000000000000\n",
      "0b11010111101101011100000000000000\n",
      "11000000\n"
     ]
    }
   ],
   "source": [
    "from ipaddress import ip_network\n",
    "\n",
    "def get_mask(host_ip, network_ip):\n",
    "    # Преобразуем IP в 32-битные числа\n",
    "    h = sum(int(x) << (24 - 8*i) for i, x in enumerate(host_ip.split('.')))\n",
    "    n = sum(int(x) << (24 - 8*i) for i, x in enumerate(network_ip.split('.')))\n",
    "\n",
    "    print(bin(h))\n",
    "    print(bin(n))\n",
    "\n",
    "    return h & n\n",
    "\n",
    "# тут все просто: разбиваем на восьмерки и смотрим маску: \n",
    "# 11111111.11111111.11110000.00000000\n",
    "\n",
    "# Решение для конкретной задачи\n",
    "mask = get_mask(\"215.181.200.27\", \"215.181.192.0\")\n",
    "\n",
    "print(bin(mask))\n",
    "\n",
    "print(int(bin(mask)[18:26]))\n",
    "\n",
    "# но нам нужно максимальное значение, поэтому добавляем две единицы"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c2790668-4f36-4d30-b490-7e175b5266da",
   "metadata": {},
   "source": [
    "Сеть задана IP-адресом 112.208.0.0 и сетевой маской 255.255.128.0.\n",
    "\n",
    "Сколько в этой сети ІР-адресов, для которых количество единиц в двоичной записи IP-адреса кратно 11? В ответе укажите только число."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "4192f602-d497-4320-983e-9579333d58ca",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3003\n"
     ]
    }
   ],
   "source": [
    "from ipaddress import ip_network\n",
    "\n",
    "net = ip_network('112.208.0.0/255.255.128.0')\n",
    "\n",
    "counter = 0\n",
    "\n",
    "for ip in net:\n",
    "    if bin(int(ip)).count(\"1\") % 11 == 0:\n",
    "        counter += 1\n",
    "\n",
    "print(counter)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "57b5821b-6e97-4557-a14b-f2f5fa5a79fa",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
